export const regexEmail = /\S+@\S+\.\S+/;
export const regexPassword =
  /^(?=.*?[a-z])(?=.*?[0-9])(?=.*?[A-Z])(?=.*?[!@#\$%\^\&*\)\(+=._-])[A-Za-z0-9!@#\$%\^\&*\)\(+=._-]{8,25}$/;
export const regexName =
  /^(?=.*?[ ])[a-zA-ZÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂẾưăạảấầẩẫậắằẳẵặẹẻẽềềểếỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵỷỹ\s\W|_]{10,25}$/;
export const regexPhone =
  /^(0?)(3[2-9]|5[6|8|9]|7[0|6-9]|8[0-6|8|9]|9[0-4|6-9])[0-9]{7}$/;
export const regexNameClass = /^(?:[1-9]|1[0-2])[a-zA-Z]$/;
